[
	{
		"name": ".net-framework",
		"displayName": ".NET Framework"
	},
	{
		"name": "alexa",
		"displayName": "Alexa",
		"description": "These projects are skills which I have written for Amazon's virtual assistant, Alexa. Currently they are all written in PHP and are hosted on my api subdomain. All of these skills and a few more are publically available to install from the Amazon Alexa app or Amazon website.",
		"aliases": [
			"alexa-sdk",
			"skill"
		]
	},
	{
		"name": "angular",
		"displayName": "Angular",
		"description": "I originally picked up Angular along with Typescript during my placement year, since then I've used it for mobile apps, websites, and desktop applications."
	},
	{
		"name": "csharp",
		"displayName": "C#",
		"description": "Having used it for over 5 years, C# is the language that I have the most experience with. For the majority of the time I have been using it to create Windows Desktop applications using WPF. More recently I have been developing APIs using ASP.NET Core.",
		"aliases": [
			"c#",
			"c-sharp"
		]
	},
	{
		"name": "java",
		"displayName": "Java",
		"description": "I originally picked up Java as a part of my university studies. Since then I've used it in industry during my placement year."
	},
	{
		"name": "mono",
		"displayName": "Mono"
	},
	{
		"name": "mongodb",
		"displayName": "MongoDB",
		"description": "These projects all use MongoDB for storing data, typically using the Mongoose Node.js library.",
		"aliases": [
			"mongo"
		]
	},
	{
		"name": "node",
		"displayName": "Node.js",
		"description": "The projects are witten using Node.JS. They might be client or server-side but will generally be written in Tyescript.",
		"aliases": [
			"nodejs"
		]
	},
	{
		"name": "nuget",
		"displayName": "NuGet",
		"description": "The projects are C# libraries which I have developed and are publically available on NuGet.org."
	},
	{
		"name": "php",
		"displayName": "PHP",
		"description": "All of my PHP knowledge is self-taught. I have used it mostly to create small APIs which are typically ono more than a couple of files. In the future I will be looking to develop similar things using Node and Typescript."
	},
	{
		"name": "typescript",
		"displayName": "Typescript",
		"description": "I originally picked up Typescript during my placement year, since then I've used it for mobile apps, websites, APIs, desktop applications, and standalone libraries.",
		"aliases": [
			"ts"
		]
	},
	{
		"name": "unity",
		"displayName": "Unity",
		"description": "These projects have been developed in the Unity Game Engine using C#."
	},
	{
		"name": "wpf",
		"displayName": "WPF",
		"description": "I've been developing C#/WPF applications since the beginning of my college course and have continued to do so in my free time during university. The projects you can see below are only from the last year or so, as my skillset as been improving rapidly."
	}
]